InformationRegisters/КомментарииКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КомментарииКандидатов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доступность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоступностьКомментарияКандидата</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСкрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоПубликации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДоступностьКомментарияКандидата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДоступностьКомментарияКандидата</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общедоступный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоДляАвтора</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/КомментарииКандидатов/Forms/КомментарийКандидата/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем СохранятьИзменения;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Запись, Параметры);
	Если Запись.Доступность = Перечисления.ДоступностьКомментарияКандидата.ТолькоДляАвтора Тогда
		ТолькоДляАвтора = Истина;
	КонецЕсли;
	
	Действие = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Действие", 
		ПодборПерсоналаКлиентСервер.ДействияСКомментариемПриРедактировании().Изменение);
	
	Если ОбщегоНазначения.СсылкаСуществует(Запись.Пользователь) Тогда
		Заголовок = ПодборПерсоналаФормы.ПредставлениеАвтораКомментария(Запись.Пользователь);
	КонецЕсли;
	
	Если Запись.Пользователь <> Пользователи.АвторизованныйПользователь() Тогда
		ТолькоПросмотр = Истина;
		Элементы.ТолькоДляАвтора.Видимость = Ложь;
		Элементы.ОК.Видимость = Ложь;
		Элементы.Отмена.Заголовок = НСтр("ru = 'Закрыть'");
		ТекущийЭлемент = Элементы.Отмена;
		КлючСохраненияПоложенияОкна = "ЧужойКомментарий";
	Иначе
		КлючСохраненияПоложенияОкна = "СвойКомментарий";
	КонецЕсли;

	Элементы.Удалить.Видимость = Запись.Пользователь = Пользователи.АвторизованныйПользователь()
		И Действие <> ПодборПерсоналаКлиентСервер.ДействияСКомментариемПриРедактировании().Добавление;
	
	Если Не ЗначениеЗаполнено(Запись.МестоПубликации) Тогда
		Элементы.ИнформационнаяНадписьМестоПубликации.Видимость = Ложь;
	Иначе
		ТолькоПросмотр = Истина;
		Элементы.ИнформационнаяНадписьМестоПубликации.Видимость = Истина;
		Элементы.ИнформационнаяНадписьМестоПубликации.Заголовок = 
			СтрШаблон(НСтр("ru = 'Добавлен на сайте %1'"), Запись.МестоПубликации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если СохранятьИзменения = Истина Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(Запись.Комментарий) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Комментарий не заполнен.'"), , , "Запись.Комментарий", Отказ);
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Запись");
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СохранятьИзменения = Истина;
	
	Если ТолькоДляАвтора Тогда
		Запись.Доступность = ПредопределенноеЗначение("Перечисление.ДоступностьКомментарияКандидата.ТолькоДляАвтора");
	Иначе
		Запись.Доступность = ПредопределенноеЗначение("Перечисление.ДоступностьКомментарияКандидата.Общедоступный");
	КонецЕсли;
	
	Результат = РезультатРедактирования();
	Результат.Действие = Действие;
	Результат.Данные = Запись;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	НачатьУдалениеКомментария();
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция РезультатРедактирования()
	Возврат ПодборПерсоналаКлиентСервер.РезультатРедактированияКомментария();
КонецФункции

&НаКлиенте
Процедура НачатьУдалениеКомментария()
	
	Если Не ПодборПерсоналаКлиент.ПроверитьКомментарийПередУдалением(Запись) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПредупреждатьОбУдаленииКомментария() Тогда
		УдалитьКомментарий();
		Возврат;
	КонецЕсли;
	
	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Истина;
	ПараметрыВопроса.ТекстФлажка = НСтр("ru = 'Больше не предупреждать'");
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Удаление комментария'");
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		Новый ОписаниеОповещения("ЗавершитьУдалениеКомментария", ЭтотОбъект), 
		НСтр("ru = 'Комментарий будет скрыт с формы, но его удаление произойдет только после записи кандидата'"), 
		РежимДиалогаВопрос.ОК, 
		ПараметрыВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьУдалениеКомментария(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат.БольшеНеЗадаватьЭтотВопрос Тогда
		СохранитьПризнакПредупреждатьОбУдаленииКомментария();
	КонецЕсли;
	
	УдалитьКомментарий();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКомментарий()

	Результат = РезультатРедактирования();
	Результат.Действие = ПодборПерсоналаКлиентСервер.ДействияСКомментариемПриРедактировании().Удаление;
	Результат.Данные = Запись;
	Закрыть(Результат);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредупреждатьОбУдаленииКомментария()
	Возврат ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		Метаданные.РегистрыСведений.КомментарииКандидатов.Формы.КомментарийКандидата.ПолноеИмя(), 
		"ПредупреждатьОбУдаленииКомментария", 
		Истина);
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьПризнакПредупреждатьОбУдаленииКомментария()
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		Метаданные.РегистрыСведений.КомментарииКандидатов.Формы.КомментарийКандидата.ПолноеИмя(), 
		"ПредупреждатьОбУдаленииКомментария", 
		Ложь);
КонецПроцедуры

#КонецОбласти
